/* Stephanie, here are some example status messages. Just copy and paste them in, CHANGE THE DATES and you should be fine. */

/* Zale E-Comm delayed */
    {
  "title": "Zale E-Comm Data Delayed",
  "messageKey": "Zale E-Comm data is currently delayed. Please check again later.",
  "type": "WARNING",
  "entityIds": [ 1,4 ],
  "validFrom": "2016/02/04 12:00 AM",
  "validTo": "2016/02/04 5:00 PM"
}

/* Zale delayed */
{
  "title": "Zale Data Delayed",
  "messageKey": "zaleDelayed",
  "type": "WARNING",
  "entityIds": [ 4 ],
  "validFrom": "2015/06/07 12:00 AM",
  "validTo": "2015/06/07 5:00 PM"
}

/* PM window */
{
  "title": "PM Window",
  "messageKey": "pmWindow",
  "type": "ERROR_ONLY",
  "validFrom": "2015/06/07 12:00 AM",
  "validTo": "2015/06/07 10:00 AM"
}

/* Maintenance (app is unavailable) */
{
  "title": "System Maintenance",
  "messageKey": "maintenance",
  "type": "UNAVAILABLE",
  "validFrom": "2015/06/08 12:00 AM",
  "validTo": "2015/06/08 5:00 PM"
}

/* Sterling delayed */
{
  "title": "Sterling Data Delayed",
  "messageKey": "sterlingDelayed",
  "type": "WARNING",
  "entityIds": [ 2 ],
  "validFrom": "2015/06/07 12:00 AM",
  "validTo": "2015/06/07 5:00 PM"
}








/*
	Signet Mobile Status Message Example
	Author: Shaun Lewis
	Date: 4/27/2015
	Usage:
		You can show messages to users under the following circumstances:
			* Maintenance
			* Only if error has occured
			* Warning message
		
		MAINTENANCE messages are the highest priority. They can be associated with entityIds opitionally. If you
		do not use an entityId, the application will not allow access until the valid to/from window has passed.
		
		If the user is currently browsing a particular entityId's data and the maintenance message appears, that
		user will be directed out of the entity's data and into the main menu during the next time that data is
		requested.
		
		
		ERROR_ONLY messages will display during the valid to/from window only if an error is returned from the
		web service. If entityIds are specified, the messages will only appear on a specific entity.
		
		
		WARNING messages will always display after a successful login. They will display for specific entities if
		entityIds are specified. If no entityIds are specified, they will be displayed right after login on the
		main menu screen within the application.
		
		
		Message keys will default to looking up a valid key. If no key is found, the message key itself will
		display as the message. If key is an empty string, it'll default to the default message.
		Example keys include:
			* "pmWindow"
			* "christmas"
			* "easter"
			* "thanksgiving"
			* "default" or ""

			"pmWindow" = "Signet Mobile is currently unavailable due to a PM window. The application will be available again after 10 a.m.";
			"zaleDelayed" = "Zale data for today is currently delayed and will be updated shortly. Please check again later this morning.";
			"sterlingDelayed" = "Sterling data for today is currently delayed and will be updated shortly. Please check again later this morning.";
			"easter" = "Data for today is currently delayed due to Easter. It will be available as scheduled tomorrow morning.";
			"thanksgiving" = "Data for today is currently delayed due to Thanksgiving. It will be available as scheduled Saturday morning.";
			"christmas" = "Data for today is currently delayed due to Christmas. It will be available as scheduled tomorrow morning.";
			"maintenance" = "Signet Mobile is currently undergoing scheduled maintenance. We apologize for any inconvenience.";
			"issues" = "Signet Mobile is currently undergoing maintenance. We apologize for any inconvenience.";
*/



[
	{
	  "title": "",
	  "messageKey": "", /* If no matching key exists in the build, the raw text is displayed e.g. "Signet Mobile is currently undergoing scheduled maintenance. We apologize for any inconvenience.\n\nIt will be available again after\n5:00 p.m. EDT" */
	  "type": "WARNING", /* MAINTENANCE, ERROR_ONLY, WARNING */
	  "entityIds": [ 1 ], /* Optional */
	  "usernames": [ "slewis", "ddixon" ], /* Optional */
	  "validFrom": "2015/04/01 12:00 AM",
	  "validTo": "2015/05/01 5:00 PM"
	}  
]